var/log/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://schema.bloyal.com/3.0" xmlns:ns2="http://bloyal.com/v3.0" xmlns:ns3="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><SOAP-ENV:Body><ns2:SubmitOrder><ns2:credential><ns1:ApplicationId>982938b6-e700-4f53-8363-ad9e03d44026</ns1:ApplicationId><ns1:DeviceKey>PVXSVXCYBG-PYHAPVMEIA-PXLRJSODSD</ns1:DeviceKey><ns1:Domain>FascTest</ns1:Domain><ns1:Password>magento1234!</ns1:Password><ns1:UserName>Magento</ns1:UserName></ns2:credential><ns2:deviceKey>PVXSVXCYBG-PYHAPVMEIA-PXLRJSODSD</ns2:deviceKey><ns2:order><ns1:Comment>Credit Card: xxxx-1111 amount $148.05 authorize - successful. Authorize.Net Transaction ID 0.  Transaction ID: &amp;quot;0&amp;quot;.</ns1:Comment><ns1:Customer><ns1:Address1>submitOrderToBloyal</ns1:Address1><ns1:Address2></ns1:Address2><ns1:BirthDate>2014-03-04</ns1:BirthDate><ns1:City>Test</ns1:City><ns1:CompanyName></ns1:CompanyName><ns1:Country>US</ns1:Country><ns1:EmailAddress>pravinm@alohatechnology.com</ns1:EmailAddress><ns1:FaxNumber></ns1:FaxNumber><ns1:FirstName>Test</ns1:FirstName><ns1:FirstName2></ns1:FirstName2><ns1:LastName>User</ns1:LastName><ns1:LastName2></ns1:LastName2><ns1:MobilePhone></ns1:MobilePhone><ns1:NickName></ns1:NickName><ns1:Phone1>12321321321</ns1:Phone1><ns1:Phone2></ns1:Phone2><ns1:State>AK</ns1:State><ns1:ZipCode>411111</ns1:ZipCode><ns1:AccountNumber></ns1:AccountNumber><ns1:ExternalId>1</ns1:ExternalId><ns1:SignupStoreCode></ns1:SignupStoreCode></ns1:Customer><ns1:ExternalId>100000014</ns1:ExternalId><ns1:Lines><ns1:OrderLine><ns1:Discount>0.0000</ns1:Discount><ns1:Product><ns1:LookupCode>WF-8711-SIL</ns1:LookupCode><ns1:Name>1 Row Choker Silver</ns1:Name><ns1:Price>7.9900</ns1:Price><ns1:Weight>123.0000</ns1:Weight></ns1:Product><ns1:QuantityOrdered>1.0000</ns1:QuantityOrdered><ns1:ShipmentNumber>18</ns1:ShipmentNumber><ns1:TaxDetails><ns1:TaxDetail><ns1:Amount>0.0000</ns1:Amount><ns1:Code>AK</ns1:Code><ns1:Rate>1.0000</ns1:Rate></ns1:TaxDetail></ns1:TaxDetails></ns1:OrderLine></ns1:Lines><ns1:Shipments><ns1:OrderShipment><ns1:CarrierCode>UPS</ns1:CarrierCode><ns1:Charge>140.0600</ns1:Charge><ns1:Recipient><ns1:Address1>submitOrderToBloyal</ns1:Address1><ns1:Address2></ns1:Address2><ns1:BirthDate>2014-03-04</ns1:BirthDate><ns1:City>submitOrderToBloyal</ns1:City><ns1:CompanyName></ns1:CompanyName><ns1:Country>US</ns1:Country><ns1:EmailAddress>pravinm@alohatechnology.com</ns1:EmailAddress><ns1:FaxNumber></ns1:FaxNumber><ns1:FirstName>Test</ns1:FirstName><ns1:FirstName2></ns1:FirstName2><ns1:LastName>User</ns1:LastName><ns1:LastName2></ns1:LastName2><ns1:MobilePhone></ns1:MobilePhone><ns1:NickName></ns1:NickName><ns1:Phone1>12321321321</ns1:Phone1><ns1:Phone2></ns1:Phone2><ns1:State>AK</ns1:State><ns1:ZipCode>411111</ns1:ZipCode></ns1:Recipient><ns1:ServiceCode>GND</ns1:ServiceCode><ns1:Tax>0.0000</ns1:Tax><ns1:TaxDetails><ns1:TaxDetail><ns1:Amount>0.0000</ns1:Amount><ns1:Code>AK</ns1:Code><ns1:Rate>1.0000</ns1:Rate></ns1:TaxDetail></ns1:TaxDetails><ns1:TotalAmount>140.0600</ns1:TotalAmount><ns1:Type>Ship</ns1:Type></ns1:OrderShipment></ns1:Shipments><ns1:Title>Web Store Order: 2014-03-04 15:23:39</ns1:Title></ns2:order><ns2:options><ns3:string>Validate</ns3:string><ns3:string>CreateCustomer</ns3:string></ns2:options></ns2:SubmitOrder></SOAP-ENV:Body></SOAP-ENV:Envelope>